const users = [
	{
		id: 1,
		user: 'user1',
		title: 'Будущее путешествий: Революция в Виртуальном Туризме',
		text: 'Исследование последствий технологических инноваций на туристическую индустрию и возможности виртуального туризма',
		fullTitle:
			'Океаны за границами экрана: Исследование тенденций виртуального туризма и их влияние на будущее отрасли',
		fullText: `В последние годы мы стали свидетелями быстрого развития виртуальной реальности и технологий дополненной реальности. Эти инновации уже начали оказывать значительное влияние на различные сферы нашей жизни, включая туризм. В нашей статье мы рассмотрим, какие изменения принесет революция в виртуальном туризме и какие возможности открываются для путешественников и индустрии в целом. 
		Одной из главных тенденций последних лет стала дальнейшая интеграция виртуальной реальности в сферу туризма. Теперь путешественники могут испытать уникальные приключения и экскурсии, не покидая своих домов. Благодаря различным VR-платформам и приложениям, таким как Google Earth VR и Wander, люди могут исследовать места, которые раньше казались недоступными. 
		Однако виртуальный туризм не только предоставляет возможность путешествовать в пространстве, но и во времени. Исторические реконструкции и виртуальные музеи позволяют погрузиться в прошлое и узнать больше о различных культурах и эпохах. 
		Несомненно, такие технологические изменения несут и некоторые вызовы для туристической индустрии. С ростом популярности виртуального туризма возникает вопрос о его влиянии на реальные путешествия и туристические объекты. Однако, большинство экспертов сходятся во мнении, что виртуальный туризм не столько конкурирует с традиционными путешествиями, сколько дополняет их, побуждая людей открывать для себя новые места и в конечном итоге, вдохновляя на реальные путешествия. 
		Таким образом, будущее туризма, вероятно, будет представлять собой гармоничное сочетание виртуальных и реальных приключений. Отрасль готовится к изменениям, внедряя новые технологии и адаптируясь к новым потребностям путешественников. Революция в виртуальном туризме уже началась, и вместе с ней открываются удивительные возможности для тех, кто стремится познать мир.`,
		email: 'user1@test.ru',
		password: 'user1',
	},
	{
		id: 2,
		user: 'LunaWisp',
		title: '"Загадочные Руины: Остатки Древних Цивилизаций под Землей',
		text: 'Исследование показывает, что многие древние цивилизации строили подземные города и хранилища, оставляя загадочные следы для современных археологов.',
		fullTitle: 'Загадочные Руины: Остатки Древних Цивилизаций под Землей',
		fullText:
			'В истории человечества заключены многие загадки, и одной из самых увлекательных является загадка древних руин, обнаруженных под землей. Исследователи по всему миру обнаружили подземные города, хранилища и структуры, свидетельствующие о том, что многие древние цивилизации обладали продвинутыми знаниями в области инженерии и строительства. Археологические находки, такие как подземные города Каппадокии в Турции, или античные подземные хранилища в Мексике, оставляют множество вопросов без ответов. Какие цели преследовались при строительстве этих сооружений? Как древние цивилизации обеспечивали свои потребности в воде, пище и безопасности под землей? Возможно ли, что подземные сооружения были созданы для защиты от природных бедствий или военных вторжений?  Некоторые исследователи предполагают, что подземные города и хранилища могли служить святилищами или местами для проведения религиозных обрядов. Другие считают, что эти сооружения были созданы для того, чтобы спрятаться от врагов или обеспечить безопасность во времена войн. Некоторые даже высказывают гипотезы о связи подземных городов с внеземными цивилизациями или загадочными культами. Однако, независимо от целей и мотивов, подземные руины представляют собой уникальные свидетельства древней истории человечества. Исследования в этой области продолжаются, принося новые открытия и расширяя наше понимание о прошлом нашей планеты.',
		email: 'LunaWisp@test.ru',
		password: 'LunaWisp',
	},
	{
		id: 3,
		user: 'user3',
		title: 'Название статьи 3',
		text: 'Текст статьи 3',
		fullTitle: 'Полное название статьи 3',
		fullText: 'Полный текст статьи 3',
		email: 'user3@test.ru',
		password: 'user3123',
	},
	{
		id: 4,
		user: 'user4',
		title: 'Название статьи 4',
		text: 'Текст статьи 4',
		fullTitle: 'Полное название статьи 4',
		fullText: 'Полный текст статьи 4',
		email: 'user4@test.ru',
		password: 'user4123',
	},
	{
		id: 5,
		user: 'user5',
		title: 'Название статьи 5',
		text: 'Текст статьи 5',
		fullTitle: 'Полное название статьи 5',
		fullText: 'Полный текст статьи 5',
		dateAdded: '31.03.2024',
		email: 'user5@test.ru',
		password: 'user5123',
	},
	{
		id: 6,
		user: 'user6',
		title: 'Название статьи 6',
		text: 'Текст статьи 6',
		fullTitle: 'Полное название статьи 6',
		fullText: 'Полный текст статьи 6',
		email: 'user6@test.ru',
		password: 'user6123',
	},
	{
		id: 7,
		user: 'user6',
		title: 'Название статьи 7',
		text: 'Текст статьи 7',
		fullTitle: 'Полное название статьи 7',
		fullText: 'Полный текст статьи 7',
		email: 'user6@test.ru',
		password: 'user6123',
	},
	{
		id: 8,
		user: 'user6',
		title: 'Название статьи 8',
		text: 'Текст статьи 8',
		fullTitle: 'Полное название статьи 8',
		fullText: 'Полный текст статьи 8',
		email: 'user6@test.ru',
		password: 'user6123',
	},
];

const fetchAllUsers = () =>
	new Promise(resolve => {
		window.setTimeout(function () {
			resolve(users);
		}, 350);
	});

const updateUser = (id, data) =>
	new Promise(resolve => {
		const userIndex = users.findIndex(u => u.id === id);
		users[userIndex] = { ...users[userIndex], ...data };
		resolve(users[userIndex]);
	});

const getUserById = id =>
	new Promise(resolve => {
		window.setTimeout(function () {
			resolve(users.find(user => user.id === id));
		}, 100);
	});

export { fetchAllUsers, getUserById, updateUser };
